Repository: EndFramework/backendpy
Catalog: docs/locale/*/LC_MESSAGES/configurations.po
Languages: fa

source: Configurations
fa: ‫تنظیمات‬

source: In Backendpy projects, all the settings of a project are defined in the ``config.ini`` file, which is located in the root path of each project and next to the main module of the project. This config file is defined in INI format, which includes sections and options. The basic list of framework configs and example of their definition is as follows:
fa: ‫در پروژه‌های Backendpy تمامی تنظیمات پروژه، داخل فایل ``config.ini`` تعریف می‌شوند که در مسیر ریشه‌ی هر پروژه و در کنار ماژول اصلی پروژه قرار می‌گیرد. این فایل تنظیمات با فرمت INI تعریف می‌شود که شامل sectionها و optionها است. فهرست پایه‌ی تنظیمات چارچوب و مثالی از نحوه‌ی تعریف آن‌ها به شرح زیر است:‬

source: In ini format, ``;`` is used for comments, ``[]`` is used to define sections, ``key = value`` is used to define values and the lines are used for list values.
fa: ‫در فرمت INI برای commentها از ``;``، برای تعریف بخش‌ها از ``[]``، برای تعریف مقادیر از ``key = value`` و برای مقادیر لیست هم از خطوط زیرهم استفاده می‌شود.‬

source: **networking** section contains values related to the server and the network.
fa: ‫بخش **networking** شامل مقادیر مرتبط با سرور و شبکه است.‬

source: **environment** section contains values such as the path to the media files and etc.
fa: ‫بخش **environment** شامل مقادیری از قبیل مسیر فایل‌های media و … است.‬

source: **apps** section contains a list of the project active applications.
fa: ‫بخش **apps** شامل لیست اپلیکیشن‌های فعال پروژه است.‬

source: **middlewares** section contains a list of the project active middlewares.
fa: ‫بخش **middlewares** شامل لیست middlewareهای فعال پروژه است.‬

source: **database** section, if using the default ORM, will include the settings related to it.
fa: ‫بخش **database** هم در صورت استفاده از ORM پیش‌فرض، شامل تنظیمات مرتبط با آن خواهد بود.‬

source: Also other custom settings may be required by any of the active apps, which must also be specified in this file. For example, an account application might have settings like this:
fa: ‫همچنین ممکن است تنظیمات اختصاصی دیگری برای هر یک از اپلیکیشن‌های فعال موردنیاز باشد که آن‌ها نیز باید در این فایل مشخص شوند. برای مثال، یک اپلیکیشن حساب کاربری ممکن است تنظیماتی مانند زیر داشته باشد: ‬

source: To protect sensitive information in the config file, such as passwords, private keys, etc., be sure to restrict access to this file. For example, set the permission to 600.
fa: ‫برای محافظت از اطلاعات حساس موجود در فایل تنظیمات مانند گذرواژه‌ها، کلیدهای خصوصی و غیره، حتما دسترسی به این فایل را محدود کنید. به عنوان مثال، مجوز آن را روی 600 قرار دهید.‬

source: In order to access the project configs inside the code, you can use the ``config`` attribute of the project :class:`~backendpy.Backendpy` class instance which contains this configs in dictionary format:
fa: ‫به منظور دسترسی به تنظیمات پروژه در داخل کد، می‌توانبد از فیلد ``config`` نمونه‌ی کلاس :class:`~backendpy.Backendpy` پروژه استفاده کنید که حاوی این تنظیمات در قالب دیکشنری است:‬

source: And similarly inside the request handlers:
fa: ‫و به‌طور مشابه در داخل توابع پردازش‌کننده‌ی درخواست‌ها:‬
