Repository: EndFramework/backendpy
Catalog: docs/locale/*/LC_MESSAGES/introduction.po
Languages: fa

source: Introduction
fa: مقدمه

source: **Backendpy** is an open-source framework for building the back-end of web projects with the Python programming language.
fa: ‫Backendpy یک چارچوب آزاد و متن‌باز برای ساخت پروژه‌های تحت وب با زبان برنامه‌نویسی پایتون است.‬

source: Why Backendpy?
fa: ‫چرا Backendpy؟‬

source: This framework does not deprive developers of their freedom by restricting them to pre-defined structures, nor does it leave some repetitive and time-consuming tasks to the developer.
fa: ‫این چارچوب نه آزادی توسعه‌دهندگان را با مقید کردن آن‌ها به ساختارهای ازپیش‌تعیین‌شده سلب می‌کند و نه برخی کارهای تکراری و زمان‌بر را بر عهده‌ی توسعه‌دهنده می‌گذارد.‬

source: Some of the features of Backendpy are:
fa: ‫برخی از ویژگی‌های Backendpy عبارت‌اند از:‬

source: Asynchronous programming (ASGI-based projects)
fa: ‫برنامه‌نویسی ناهمگام (پروژه‌های مبتنی بر ASGI)‬

source: Application-based architecture and the ability to install third-party applications in a project
fa: ‫معماری اپلیکیشن‌محور و قابلیت نصب آسان اپلیکیشن‌های ثالث توسط ابزار pip و فعال‌سازی آن‌ها در پروژه‬

source: Support of middlewares for different layers such as Application, Handler, Request or Response
fa: ‫پشتیبانی از انواع مختلف Middlewareها مختص لایه‌های Request، Handler، Application یا Response‬

source: Supports events and hooks
fa: ‫پشتیبانی از Eventها و Hookها‬

source: Data handler classes, including validators and filters to automatically apply to request input data
fa: ‫کلاس‌های Data Handler‌، شامل اعتبارسنج‌ها و فیلترها برای اعمال خودکار روی داده‌های ورودی Requestها‬

source: Supports a variety of responses including JSON, HTML, file and… with various settings such as stream, gzip and…
fa: ‫پشتیبانی از انواع Responseها شامل JSON، HTML، File و … با تنظیمات مختلف از قبیل stream، gzip و …‬

source: Router with the ability to define urls as Python decorator or as separate files
fa: ‫Router با قابلیت تعریف Urlها به‌صورت Decorator پایتونی و یا به‌صورت فایل‌های مجزا (برحسب سلیقه‌ی توسعه‌دهنده)‬

source: Application-specific error codes
fa: ‫کدهای خطای مختص هر اپلیکیشن‬

source: Optional default database layer by the Sqlalchemy async ORM with management of sessions for the scope of each request
fa: ‫لایه‌ی Database پیش‌فرض (اختیاری) Async توسط Sqlalchemy ORM و سیستم پایگاه‌داده‌ی Postgresql با مدیریت بهینه‌ی Sessionها برای محدوده‌ی هر Request‬

source: Optional default templating layer by the Jinja template engine
fa: ‫لایه‌ی Templaing پیش‌فرض (اختیاری) توسط Jinja template engine‬

source: License
fa: ‫پروانه‬

source: The Backendpy framework licensed under the BSD 3-Clause terms. The source code is available at https://github.com/savangco/backendpy.
fa: ‫چارچوب Backendpy به‌صورت متن‌باز و با مجوز آزاد BSD 3-Clause منتشر شده است. کد منبع این چارچوب در آدرس https://github.com/savangco/backendpy در دسترس قرار گرفته است.‬

source: This project is under active development.
fa: ‫این پروژه در حال توسعه است.‬
