Repository: EndFramework/backendpy
Catalog: docs/locale/*/LC_MESSAGES/project_creation.po
Languages: fa

source: Create a Project
fa: ‫ایجاد پروژه‬

source: Basic Structure
fa: ‫ساختار پایه‬

source: A Backendpy-based project does not have a mandatory, predetermined structure, and it is the programmer who decides how to structure his project according to his needs.
fa: ‫یک پروژه‌ی مبتنی بر Backendpy ساختار اجباری و از پیش‌تعیین‌شده‌ای ندارد و این برنامه‌نویس است که تصمیم می‌گیرد برحسب سلیقه و نیازهایش، پروژه‌ی خود را به چه نحوی ساختاربندی کند.‬

source: The programmer only needs to create a Python module with a custom name (for example "main.py") and set the instance of ``Backendpy`` class (which is an ASGI application) inside it.
fa: ‫برنامه‌نویس نیاز است یک ماژول پایتون با نام دلخواه (برای مثال main.py) ایجاد و نمونه‌ی کلاس Backendpy (که یک اپلیکیشن ASGI است) را داخل آن مقداردهی کند.‬

source: Also for project settings, the ``config.ini`` file can be created in the same path next to the module. Check out the :doc:`configurations` section for more information.
fa: ‫همچنین برای تنظیمات پروژه، فایل config.ini می‌تواند در همان مسیر در کنار ماژول ایجاد شود. برای اطلاعات بیشتر بخش :doc:`configurations` را ببینید.‬

source: We can now add HTTP requests handlers to the project as follows:
fa: ‫اکنون می‌توانیم کنترل‌کننده‌های درخواست‌های HTTP را به‌صورت زیر به پروزه اضافه کنیم:‬

source: But it is recommended to use applications for this purpose.
fa: ‫اما توصیه می شود از اپلیکیشن‌ها برای این منظور استفاده شود.‬

source: Applications
fa: ‫اپلیکیشن‌ها‬

source: Backendpy projects can also be developed by components called Applications, which, although not mandatory, it is recommended that applications be used to better structure the projects. It is also possible to connect third-party apps to the project.
fa: ‫پروژه‌‌هایBackendpy می‌توانند توسط اجزایی به‌نام Applicationها نیز توسعه داده شوند، که اگرچه استفاده از آن‌ها اجباری نیست اما توصیه می‌شود که به‌منظور ساختاربندی بهتر پروژه‌ها از Applicationها استفاده شود. همچنین امکان اتصال اپ‌های ثالث به پروژه وجود دارد.‬

source: To create an application, first create a package containing the ``main.py`` module in the desired path within the project (or any other path that can be imported).
fa: ‫برای ایجاد یک اپلیکیشن، ابتدا یک پکیج حاوی ماژول ``main.py`` در مسیری دلخواه در داخل پروژه (یا هر مسیر دیگری که قابلیت import داشته باشد) ایجاد کنید.‬

source: Then inside the main.py module of an application we need to set an instance of the ``App`` class. All parts and settings of an application are assigned by the parameters of the App class, which are listed below. Each of these parameters and classes will be described in detail in the following sections.
fa: ‫سپس در ماژول main.py یک اپلیکیشن باید نمونه‌ای از کلاس ``App`` را مقداردهی کنیم. تمام قسمت‌ها و تنظیمات یک اپلیکیشن توسط پارامترهای کلاس App تخصیص داده می‌شوند که در زیر فهرست شده‌اند. هر یک از این پارامترها و کلاس‌ها در بخش‌های بعدی به تفصیل توضیح داده خواهند شد. ‬

source: A class used to represent Backendpy internal application
fa: ‫کلاسی که برای تعریف اپلیکیشن داخلی Backendpy استفاده می شود‬

source: Parameters
fa: ‫پارامترها‬

source: List of instances of the Routes class
fa: ‫لیستی از نمونه‌های کلاس Routes‬

source: List of instances of the Hooks class (or None)
fa: ‫لیستی از نمونه‌های کلاس Hooks (یا None)‬

source: List of module paths that contain database models (or None)
fa: ‫لیستی از مسیر‌های ماژول‌هایی که حاوی مدل‌های دیتابیس‌اند (یا None)‬

source: List of paths (within the application directory) from which templates will be searched (or None)
fa: ‫لیستی از مسیر‌ها (در داخل مسیر اپلیکیشن) که قالب‌ها از آن‌ها جستجو خواهند شد (یا None)‬

source: List of instances of the ErrorList class (or None)
fa: ‫لیستی از نمونه‌های کلاس ErrorList (یا None)‬

source: The initialization function of the application (or None)
fa: ‫تابع مقداردهی اولیه‌ی اپلیکیشن (یا None)‬

source: For example, in the "/apps" path inside the project, we create a package called "hello" and main.py file as follows:
fa: ‫به عنوان مثال در مسیر /apps در داخل پروژه، بسته‌ای به نام hello و فایل main.py را به صورت زیر ایجاد می‌کنیم:‬

source: Now we have written the previous Hello project by applications.
fa: ‫اکنون ما پروژه‌ی Hello قبلی را به‌کمک اپلیکیشن‌ها نوشتیم.‬

source: As you can see, we have created another optional module called handlers.py and then introduced the routes defined in it to the App class instance. Only the items that are introduced to the App class are important to the framework, and the internal structuring of the applications is completely optional.
fa: ‫همانطور که مشاهده می‌کنید در اینجا ماژول اختیاری دیگری به نام handlers.py را ایجاد کرده‌ایم و سپس Routeهای تعریف‌شده در آن را به نمونه‌ی کلاس App معرفی کرده‌ایم. قابل ذکر است که فقط مواردی که به کلاس App معرفی می‌شوند برای چارچوب مهم‌اند و ساختار داخلی اپلیکیشن‌ها کاملا اختیاری است.‬

source: Our application is now ready and you just need to enable it in the project config.ini file as follows:
fa: ‫اکنون اپلیکیشن ما آماده است و تنها نیاز است که آن را در فایل config.ini پروژه به‌صورت زیر فعال‌سازی کنیم:‬

source: To run the project, see the :doc:`run` section.
fa: ‫برای اجرای پروژه، بخش :doc:`run` را ببینید.‬

source: Command line
fa: ‫خط‌فرمان‬

source: The ``backendpy`` command can also be used to create projects and apps. To do this, first enter the desired path and then use the following commands:
fa: ‫دستور خط‌فرمان ``backendpy`` نیز می‌تواند برای ایجاد پروژه‌ها و اپلیکیشن‌ها استفاده شود. برای این کار ابتدا وارد مسیر موردنظر شده و سپس از دستورات زیر استفاده کنید:‬

source: Project Creation
fa: ‫ایجاد پروژه‬

source: To create a project with more complete sample components:
fa: ‫برای ایجاد یک پروژه با اجزای نمونه‌ی کامل‌تر:‬

source: App Creation
fa: ‫ایجاد اپلیکیشن‬
